README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2014-10-18 Sat 15:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Silas Bartel" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Denpendencies</a></li>
<li><a href="#sec-2">2. Installation</a></li>
<li><a href="#sec-3">3. CMake options</a>
<ul>
<li><a href="#sec-3-1">3.1. ENGINE</a></li>
<li><a href="#sec-3-2">3.2. GLEW</a></li>
<li><a href="#sec-3-3">3.3. BOOST</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Troubleshooting:</a>
<ul>
<li><a href="#sec-4-1">4.1. CMake can not find Boost</a></li>
<li><a href="#sec-4-2">4.2. CMake complains about an outdated Boost version even though the newest Version has been compiled by myself</a></li>
<li><a href="#sec-4-3">4.3. CMake can not find GLEW</a></li>
<li><a href="#sec-4-4">4.4. I crosscompiled the project on Linux and want to test the result with WINE but WINE crashes immediately.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<pre class="example">
 _____   _____            _
|  ___| |  ___|          (_)
| |__   | |__ _ __   __ _ _ _ __   ___
|  __|  |  __| '_ \ / _` | | '_ \ / _ \
| |___  | |__| | | | (_| | | | | |  __/
\____/  \____/_| |_|\__, |_|_| |_|\___|
                     __/ |
                    |___/
</pre>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Denpendencies</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>CMake v2.8.9 or newer [<a href="http://www.cmake.org/">http://www.cmake.org/</a>]
</li>
<li>The OpenGL headers (often in a mesa package)
</li>
<li>Linux/UNIX (at least one of those):
<ul class="org-ul">
<li>X11 and it's headers (including RandR)
</li>
<li>Wayland and it's headers (not yet supported)
</li>
<li>Mir and it's headers (not yet supported)
</li>
</ul>
</li>
<li>Boost v1.48.0 or newer [<a href="http://www.boost.org/">http://www.boost.org/</a>]
</li>
<li>GLEW v1.6.0 or newer [<a href="http://glew.sourceforge.net/">http://glew.sourceforge.net/</a>]
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
Download from git server at this moment only with invitation.
</p>

<div class="org-src-container">

<pre class="src src-sh">$ git clone git@mprs-bartel.de:/git/engine.git
$ ./generate.sh
$ mkdir build
$ cd build
$ cmake &lt;Additional CMake options&gt; ..
$ make
$ make install
</pre>
</div>

<p>
Alternatively, you can use ninja instead of make by adding -G Ninja to your cmake options.
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> CMake options</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> ENGINE</h3>
<div class="outline-text-3" id="text-3-1">
<p>
-DCMAKE<sub>INSTALL</sub><sub>PREFIX</sub>=/Install/prefix/of/engine
</p>

<p>
-DENGINE<sub>VERBOSE</sub>=&lt;0/1&gt;
  Special cmake output and verbose compiler messages &#x2026;
    0: disabled - default
    1: enabled
</p>

<p>
-DDISPLAY<sub>SERVER</sub>=&lt;which&gt;
  Possible options:
</p>
<ul class="org-ul">
<li>UNIX<sub>X11</sub>     - default
</li>
<li>WINDOWS      - alpha
</li>
<li>UNIX<sub>WAYLAND</sub> - not yet supported
</li>
<li>UNIX<sub>MIR</sub>     - not yet supported
</li>
</ul>

<p>
-DENGINE<sub>LINK</sub><sub>SHARED</sub>=&lt;0/1&gt;
  Link the engine &#x2026;
    0: static
    1: shared - default
</p>

<p>
-DENGINE<sub>BUILD</sub><sub>SHARED</sub>=&lt;0/1&gt;
  Build the engine &#x2026;
    0: static
    1: shared - default
</p>

<p>
-DLOG<sub>FALLBACK</sub>=&lt;0/1&gt;
  Compile fallback to avoid compile errors &#x2026;
    0: disabled - default
    1: enabled
</p>

<p>
-DEXTRA<sub>CXX</sub><sub>FLAGS</sub>=&lt;Extra CXX compiler options&gt;
</p>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> GLEW</h3>
<div class="outline-text-3" id="text-3-2">
<p>
-DGLEW<sub>USE</sub><sub>DEFAULT</sub>=&lt;0/1&gt;
  if you want to have your system GLEW
    0: disabled - default
    1: enabled
</p>

<p>
-DGLEW<sub>ROOT</sub>=/Path/to/GLEW/install/prefix
</p>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> BOOST</h3>
<div class="outline-text-3" id="text-3-3">
<p>
-DBOOST<sub>NO</sub><sub>SYSTEM</sub><sub>PATHS</sub>=&lt;0/1&gt;
   To tell CMake to only search boost in BOOST<sub>ROOT</sub>
    0: disabled - default
    1: enabled
</p>

<p>
-DBOOST<sub>ROOT</sub>=/Path/to/Boost/install/prefix
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Troubleshooting:</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> CMake can not find Boost</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Try to set:
  -DBOOST<sub>ROOT</sub>=/Path/to/Boost/install/prefix
</p>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> CMake complains about an outdated Boost version even though the newest Version has been compiled by myself</h3>
<div class="outline-text-3" id="text-4-2">
<p>
You can either remove your native boost installation or set
  -DBoost<sub>NO</sub><sub>SYSTEM</sub><sub>PATHS</sub>=1
and
  -DBOOST<sub>ROOT</sub>=/Path/to/Boost/install/prefix
</p>
</div>
</div>


<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> CMake can not find GLEW</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Try to set:
-DGLEW<sub>ROOT</sub>=/Path/to/GLEW/install/prefix
</p>
</div>
</div>


<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> I crosscompiled the project on Linux and want to test the result with WINE but WINE crashes immediately.</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Wine doesnt like boost::wregex because a function was unimplemented: <a href="http://bugs.winehq.org/show_bug.cgi?id=36617">BUG</a>
</p>

<p>
Try to update your WINE version.
Or set:
  -DEXTRA<sub>CXX</sub><sub>FLAGS</sub>=-DUGLY<sub>WINE</sub><sub>WORKAROUND</sub>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Silas Bartel</p>
<p class="date">Created: 2014-10-18 Sat 15:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
